MMBytes/MultiGeiger-V2/sdkconfig.defaults.feathers3_d
# ============================================================================
# Unexpected Maker FeatherS3-D overlay — ESP32-S3, 16 MB flash, 8 MB QSPI
# PSRAM, native USB-C (no CP2102).
# ============================================================================

CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash on FeatherS3-D.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# QSPI PSRAM at 80 MHz. Quad mode per the product page; flip to
# CONFIG_SPIRAM_MODE_OCT=y if a future revision uses octal-mode silicon
# (the XIAO ESP32-S3 overlay does exactly this — same chip, different
# PSRAM interface). Verified once chip-info boot line reports the package.
# NOTE: IDF v6.0 renamed this symbol from SPIRAM_MODE_OCTAL → MODE_OCT.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Heap-spill policy (ALWAYSINTERNAL/RESERVE_INTERNAL) and the V2.5.33 network/TLS
# PSRAM-offload knobs are identical across all PSRAM boards and live in the
# shared sdkconfig.defaults ("PSRAM heap policy" section).

# Console / flashing path: USB-Serial-JTAG (S3 built-in, no TinyUSB needed).
# `printf` and `ESP_LOGx` go to USB-C; `idf.py flash` uses the same port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# UART0 still routed but secondary — leave RX/TX (IO44/IO43) free for
# external probing; firmware does not use them as a console.

# ============================================================================
# V2.5.34: ESP-IDF Wi-Fi roaming app (PSRAM boards only — Heltec excluded; the
# app's scan/candidate machinery wants heap headroom). Fixes a node getting STUCK
# on a weak/distant mesh BSSID after a beacon-timeout reconnect (observed on .198:
# stuck at -82 dBm for ~75 min until a lucky 2nd disconnect landed it on -31 dBm).
#
# Config: LOW-RSSI trigger + LEGACY roam (forcible disconnect->reconnect to a
# stronger BSSID — works WITHOUT AP 802.11k/v, which this mesh lacks: pmf:0).
# Threshold -72 dBm (healthy APs here are -29..-31, so only act when genuinely
# degraded). Periodic-scan monitor OFF (active scans every 30 s would punch holes
# in the 180 s TX cycle); 802.11v/BTM OFF (needs AP support). Hysteresis + 15 s
# backoff = IDF defaults. main.c hands reconnect ownership to the app under
# CONFIG_ESP_WIFI_ENABLE_ROAMING_APP so our loop doesn't double-drive connect.
# NOTE: Espressif flags this EXPERIMENTAL (gated by IDF_EXPERIMENTAL_FEATURES) —
# bench-validate on ONE node before fleet OTA.
# ============================================================================
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_ESP_WIFI_ENABLE_ROAMING_APP=y
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_ROAMING=y
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_THRESHOLD=-72
CONFIG_ESP_WIFI_ROAMING_PERIODIC_SCAN_MONITOR=n
CONFIG_ESP_WIFI_ROAMING_LEGACY_ROAMING=y
CONFIG_ESP_WIFI_ROAMING_NETWORK_ASSISTED_ROAM=n
